export const timeTable = [
    {
        id: 0,
        week: 'Неделя 1',
        days: [
            {
                id: 0,
                name: 'Понедельникw1',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое1w1',
                finished: true,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 1,
                name: 'Вторникw1',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое2w1',
                finished: true,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое3',
                finished: false,
                isToday: true,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        current: true,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое4',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое5',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
        ],
    },
    {
        id: 1,
        week: 'Неделя 2',
        days: [
            {
                id: 0,
                name: 'Понедельникw2',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw2',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 1,
                name: 'Вторникw2',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw2',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
        ],
    },
    {
        id: 2,
        week: 'Неделя 3',
        days: [
            {
                id: 0,
                name: 'Понедельникw3',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw3',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 1,
                name: 'Вторникw3',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw3',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
        ],
    },
    {
        id: 3,
        week: 'Неделя 4',
        days: [
            {
                id: 0,
                name: 'Понедельникw4',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw4',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 1,
                name: 'Вторникw4',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкоеw4',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                finished: false,
                isToday: false,
                blocks: [
                    {
                        id: 0,
                        name: 'Разминка',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                                finished: false,
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                                finished: false,
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                                finished: false,
                            },
                        ],
                    },
                    {
                        id: 1,
                        name: 'Блок 1',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                        ],
                    },
                    {
                        id: 2,
                        name: 'Блок 2',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                    {
                        id: 3,
                        name: 'Блок 3',
                        finished: false,
                        exercises: [
                            {
                                id: 0,
                                name: 'Упр 1',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку1',
                                    'Взятие в стойку1',
                                    'Пуловер обратным хватом1',
                                ],
                            },
                            {
                                id: 1,
                                name: 'Упр 2',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку2',
                                    'Взятие в стойку2',
                                    'Пуловер обратным хватом2',
                                ],
                            },
                            {
                                id: 2,
                                name: 'Упр 3',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку3',
                                    'Взятие в стойку3',
                                    'Пуловер обратным хватом3',
                                ],
                            },
                            {
                                id: 3,
                                name: 'Упр 4',
                                desc: 'В этом блоке вам предстоит как следует разогреть мышцы и прийти в тонус, не торопитесь, но постарайтесь уложиться в 15 минут. Шаг процентовки 5%, уменьшаем если тяжело.',
                                blockExercises: [
                                    'Тяга к подбородку4',
                                    'Взятие в стойку4',
                                    'Пуловер обратным хватом4',
                                ],
                            },
                        ],
                    },
                ],
            },
        ],
    },
];
