export const timeTable = [
    {
        id: 0,
        week: 'Неделя 1',
        days: [
            {
                id: 0,
                name: 'Понедельник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое1',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 1,
                name: 'Вторник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое2',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое3',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое4',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое5',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
        ],
    },
    {
        id: 1,
        week: 'Неделя 2',
        days: [
            {
                id: 0,
                name: 'Понедельник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 1,
                name: 'Вторник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
        ],
    },
    {
        id: 2,
        week: 'Неделя 3',
        days: [
            {
                id: 0,
                name: 'Понедельник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 1,
                name: 'Вторник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
        ],
    },
    {
        id: 3,
        week: 'Неделя 4',
        days: [
            {
                id: 0,
                name: 'Понедельник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 1,
                name: 'Вторник',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 2,
                name: 'Среда',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 3,
                name: 'Четверг',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
            {
                id: 4,
                name: 'Пятница',
                desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
                mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
                specWarmUp:
                    'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
                tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
                condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
            },
        ],
    },
];
