// import React from 'react';

// const Program = () => {
//     return <div></div>;
// };

// export default Program;

// const timeTable = {
//     week1: {
//         Monday: {
//             name: 'Понедельник',
//             desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
//             mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
//             specWarmUp:
//                 'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
//             tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
//             condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
//         },
//         Tuesday: {
//             name: 'Вторник',
//             desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
//             mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
//             specWarmUp:
//                 'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
//             tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
//             condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
//         },
//         Wednesday: {
//             name: 'Среда',
//             desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
//             mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
//             specWarmUp:
//                 'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
//             tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
//             condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
//         },
//         Thursday: {
//             name: 'Четверг',
//             desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
//             mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
//             specWarmUp:
//                 'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
//             tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
//             condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
//         },
//         Friday: {
//             name: 'Пятница',
//             desc: 'Сегодня легкое кардио — приготовься выплюнуть легкое',
//             mfr: 'Зубчатая мышца на валике, разгибание грудного отдела на валике, грудная мышца на мяче, суставная капсула на мяче, растяжка грудного отдела на коробе, экстензия грудного отдела, разрыв резины, экстензия ягодиц.',
//             specWarmUp:
//                 'Тяга до колен рывковым хватом с паузой, тяга до подрыва рывковым хватом с паузой, рывковая тяга к подбородку, рывок с паха в стойку/сед, рывковый баланс, оверхед присед.',
//             tech: 'Рывок с паха в сед, рывковый баланс, оверхед присед.',
//             condPart: 'Рывок с паха в стойку, подтягивания, байк, бег.',
//         },
//     },
// };
